app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.all

INSERT INTO "stories" ("story_id", "title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["story_id", 1], ["title", "Life at work"], ["text", "its good"], ["created_at", "2023-07-03 05:31:05.096964"], ["updated_at", "2023-07-03 05:31:05.096964"]]
---
  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save

UPDATE "stories" SET "text" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["text", " Started GET \"/sto"], ["updated_at", "2023-07-16 08:44:58.723649"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @story.update(story_params)

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_story
      @story = Story.find(params[:id])